## 📝 Terraform Plan Results

### 📂 Directory: `terraform`

<details><summary>Show Plan</summary>

```hcl
aws_kms_key.dst: Refreshing state... [id=930940d7-ab33-4066-aa2f-5d5ebcf0c71d]
aws_s3_bucket.dst: Refreshing state... [id=porel-2]
data.aws_caller_identity.current: Reading...
aws_iam_role.replication: Refreshing state... [id=replication-rodier]
data.aws_caller_identity.current: Read complete after 0s [id=204469479814]
aws_kms_key.src: Refreshing state... [id=55d12340-023b-46e3-b5f0-677d3b57af5c]
aws_s3_bucket_versioning.dst_versioning: Refreshing state... [id=porel-2]
aws_s3_bucket_server_side_encryption_configuration.dst_enc: Refreshing state... [id=porel-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.replication must be replaced
-/+ resource "aws_iam_role" "replication" {
      ~ arn                   = "arn:aws:iam::204469479814:role/replication-rodier" -> (known after apply)
      ~ create_date           = "2025-12-08T17:20:17Z" -> (known after apply)
      ~ id                    = "replication-rodier" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "replication-rodier" -> "replication-rodiertoumani" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAS7G2UVGDIODDK3YH3" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role_policy.replication_policy will be created
  + resource "aws_iam_role_policy" "replication_policy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_s3_bucket.dst must be replaced
-/+ resource "aws_s3_bucket" "dst" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::porel-2" -> (known after apply)
      ~ bucket                      = "porel-2" -> "porelmoumani" # forces replacement
      ~ bucket_domain_name          = "porel-2.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "us-west-2" -> (known after apply)
      ~ bucket_regional_domain_name = "porel-2.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "porel-2" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "env" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "adaa0973cd94c0b1d367db55dcda34a2cd215cc5e15f03ff63e778974a811517" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:us-west-2:204469479814:key/930940d7-ab33-4066-aa2f-5d5ebcf0c71d" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.src will be created
  + resource "aws_s3_bucket" "src" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "rodiertoumani"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "env" = "dev"
        }
      + tags_all                    = {
          + "ManagedBy" = "Terraform"
          + "env"       = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_replication_configuration.replication will be created
  + resource "aws_s3_bucket_replication_configuration" "replication" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-west-2"
      + role   = (known after apply)

      + rule {
          + id     = "replicate-all"
          + status = "Enabled"

          + destination {
              + bucket        = (known after apply)
              + storage_class = "STANDARD"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.dst_enc must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "dst_enc" {
      ~ bucket                = "porel-2" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "porel-2" -> (known after apply)
        # (2 unchanged attributes hidden)

      - rule {
          - blocked_encryption_types = [] -> null
          - bucket_key_enabled       = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:us-west-2:204469479814:key/930940d7-ab33-4066-aa2f-5d5ebcf0c71d" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-west-2:204469479814:key/930940d7-ab33-4066-aa2f-5d5ebcf0c71d"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.src_enc will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "src_enc" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-west-2"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-west-2:204469479814:key/55d12340-023b-46e3-b5f0-677d3b57af5c"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.dst_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "dst_versioning" {
      ~ bucket                = "porel-2" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "porel-2" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.src_versioning will be created
  + resource "aws_s3_bucket_versioning" "src_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-west-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 9 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ replication_role_arn = "arn:aws:iam::204469479814:role/replication-rodier" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

